ReadMe.md

# Table of Contents

1.  [Table of content](#org5dc5102)
2.  [Getting started with the project](#org644e380)
    1.  [Installing client side](#orgccd1b35)
    2.  [Installing server side](#orgefec416)
3.  [Folder structure](#orgba86526)
    1.  [Images](#org9217dcd)
    2.  [public](#org7e4025c)
    3.  [server](#orgc855b7c)
    4.  [src](#orgcad6af0)
4.  [Example](#orgc645f02)
    1.  [A example database is included in the root folder of the project. exampleDatabase](#orgf06951c)
        1.  [For Installation follow the below steps:](#org710eaeb)


<a id="org5dc5102"></a>

<a id="org644e380"></a>

# Getting started with the project


<a id="orgccd1b35"></a>

## Installing client side

root directory is the client side.

-   run npm install
    This will install all the required dependency for the project.
-   run npm start
    This will start the test server on the default browser.


<a id="orgefec416"></a>

## Installing server side

root/server is the server side directory

-   run npm install
    This will install all the required dependency for the project.
-   run nodemon index
    This will run the server side for the client.


<a id="orgba86526"></a>

# Folder structure


<a id="org9217dcd"></a>

## Images

This contains test images for the project


<a id="org7e4025c"></a>

## public

This folder is auto generated by the react library

-   [index.html](public/index.html) this is the main html in which react append
    AJX code from the src folder.
-   [mainfest.json](public/manifest.json) this file contains all the meta data for
    the website including icons and sort name and other things.


<a id="orgc855b7c"></a>

## server

-   [db.js](server/db.js) this file creates the return the connection object for
    the database.
-   [index.js](server/index.js) this file contains the all the route required by the
    client to function properly.


<a id="orgcad6af0"></a>

## src

This folder has the all the components required for the front end.

-   [Assets](src/Assets)
    This folder contains assest required by react
-   [Components](src/Components)
    This is the place where all the components lives.
    -   [Med](src/Components/Med/)
        This directory contains all the things related to medicine and home page.
    -   [Profile](src/Components/Profile/)
        This directory contains all the components related to profile page like.
        1.  Changing user roles
        2.  Updating medicine contains
        3.  Adding Medicine
        4.  Changing password
        5.  Changing passphrase
    -   [Static](src/Components/Static/)
        This folder contains all the static things like
        1.  Loading page
        2.  Login page
        3.  Navbar
        4.  Sign up page


<a id="orgc645f02"></a>

# Example


<a id="orgf06951c"></a>

## A example database is included in the root folder of the project. [exampleDatabase](file:///rollingMeds.db)


<a id="org710eaeb"></a>

### For Installation follow the below steps:

-   In MariaDB shell
    
        CREATE DATABASE rollingMeds;
-   In shell
    
        mysql -u root -p rollingMeds < ./rollingMeds.db

